/** 表格表头数据 */

// 商务模块
// 商务人员表格数据
const businessStaffTable = {
  thData1: [
    '姓名',
    '承载方投放总数(家)',
    '投放设备总数(台)',
    '下属承载方累计流水(元)',
    '本人累计分成(元)',
    '昨日下属承载方流水(元)',
    '昨日本人分成(元)',
    '统计日期',
    '更多'
  ],
  tdData1: [
    '季春',
    '45',
    '10000',
    '30700',
    '5000',
    '400',
    '200',
    '2018—11—05',
    '>>'
  ],
  headData: '下属承载方概况',
  thData2: [
    '承载方名称',
    '设备数',
    '流水估值(日)',
    '流水估值(月)',
    '平均日订单数'
  ],
  tdData2: [
    '网鱼网咖(龙阳路店)',
    '100',
    '200',
    '1000',
    '30'
  ]
}

// 财务模块
// 流水统计表格数据
const financeSalesTable = {
  thData1: [
    '公司设备总数(台)',
    '在投设备总数(台)',
    '昨日总流水(元)',
    '设备平均流水(元)',
    '昨日退款(元)',
    '公司分成(元)',
    '商务分成(元)',
    '承载方分成(元)',
    '统计日期',
    '更多'
  ],
  tdData1: [
    '66900',
    '66900',
    '10000',
    '13',
    '-12',
    '22',
    '32',
    '12',
    '2018—11—05',
    '>>'
  ],
  headData: '流水统计',
  thData2: [
    '退款账户',
    '设备开启时间',
    '设备退款时间',
    '退款金额(元)'
  ],
  tdData2: [
    '15110672285',
    '10:35:10',
    '10:35:10',
    '打款完成'
  ]
}
// 退款统计表格数据
const financeRefundTable = {
  thData1: [
    '退款金额总计(元)',
    '退款单数总计(单)',
    '支付宝退款金额(元)',
    '微信退款金额(元)',
    '统计日期',
    '状态',
    '更多'
  ],
  tdData1: [
    '370',
    '12',
    '12',
    '13',
    '2018—11—05',
    '2018—11—05',
    '>>'
  ],
  headData: '退款历史明细',
  thData2: [
    '退款账户',
    '设备开启时间',
    '设备退款时间',
    '退款金额(元)'
  ],
  tdData2: [
    '15110672285',
    '10:35:10',
    '10:35:10',
    '打款完成'
  ]
}
// 提现统计表格数据
const financeWithdrawTable = {
  thData1: [
    '承载方名称',
    '开户行',
    '账号名称',
    '银行账号',
    '提现金额(元)',
    '状态',
    '提现次数',
    '申请时间',
    '操作',
    '更多'
  ],
  tdData1: [
    '网鱼网咖',
    '建设银行',
    '黄艺杰',
    '151106722852222222222',
    '1200',
    '申请提现',
    '5',
    '2018—11—05',
    '确认/驳回',
    '>>'
  ],
  headData: '网鱼网咖提现历史明细',
  thData2: [
    '申请时间',
    '打款时间',
    '提现金额(元)',
    '状态'
  ],
  tdData2: [
    '2018—11—05',
    '2018—11—10',
    '200',
    '打款完成'
  ]
}

// 运维模块
// 设备在线情况表格数据
const maintainerOnlineTable = {
  thData1: [
    '承载方名称',
    '所属区域',
    '区域运维人员',
    '在线数量',
    '投放数量',
    '在线率',
    '在线时长',
    '统计日期',
    '更多'
  ],
  tdData1: [
    '网鱼网咖',
    '汇南',
    '井宝',
    '199',
    '5000',
    '0.9',
    '7',
    '2018—11—05',
    '>>'
  ],
  headData: '在线率历史明细',
  thData2: [
    '统计日期',
    '在线数量',
    '投放数量',
    '在线率',
    '在线时长'
  ],
  tdData2: [
    '2018—11—05',
    '100',
    '200',
    '0.5',
    '30'
  ]
}
// 设备使用情况表格数据
const maintainerUseRateTable = {
  thData1: [
    '承载方名称',
    '所属商务',
    '设备投放总数',
    '起效设备数量',
    '闲置设备',
    '设备使用率',
    '昨日订单量',
    '场景订单率',
    '统计日期',
    '更多'
  ],
  tdData1: [
    '网鱼网咖',
    '季春',
    '500',
    '100',
    '199',
    '0.5',
    '200',
    '0.5',
    '2018—11—05',
    '>>'
  ],
  headData: '使用率历史明细',
  thData2: [
    '统计日期',
    '投放数量',
    '起效设备数量',
    '闲置数量',
    '使用率'
  ],
  tdData2: [
    '2018—11—05',
    '100',
    '200',
    '30',
    '0.5'
  ]
}

// 仓库模块
// 仓库基本情况表格数据
const storeClerkStatusTable = {
  headData1: '囤积清单',
  thData1: [
    '物品名称',
    '数量',
    '单价(元)',
    '总价(元)',
    '创建时间',
    '修改时间',
    '操作'
  ],
  tdData1: [
    '抱枕(38*38)',
    '6000',
    '268',
    '1000000',
    '2018—11—10',
    '2018—11—10',
    '修改'
  ],
  headData2: '采购清单',
  thData2: [
    '物品名称',
    '数量',
    '单价(元)',
    '总价(元)',
    '创建时间',
    '修改时间',
    '操作'
  ],
  tdData2: [
    '抱枕(38*38)',
    '6000',
    '268',
    '1000000',
    '2018—11—10',
    '2018—11—10',
    '修改/采购完成'
  ],
  headData3: '添加囤积物品',
  headList3: [
    '物品名称:',
    '物品数量:',
    '物品单价:',
    '物品总价:'
  ],
  headData4: '添加采购物品',
  headList4: [
    '物品名称:',
    '物品数量:',
    '物品单价:',
    '物品总价:'
  ]
}
// 仓库出入库统计表格数据
const storeClerkStatisticsTable = {
  headData1: '出库清单',
  thData1: [
    '物品名称',
    '出库责任人',
    '出库数量',
    '出库时间',
    '创建时间',
    '修改时间',
    '操作'
  ],
  tdData1: [
    '抱枕(38*38)',
    '井宝',
    '6000',
    '2018—11—10',
    '2018—11—10',
    '2018—11—10',
    '修改'
  ],
  headData2: '入库清单',
  thData2: [
    '物品名称',
    '出库责任人',
    '出库数量',
    '出库时间',
    '创建时间',
    '修改时间',
    '操作'
  ],
  tdData2: [
    '抱枕(38*38)',
    '井宝',
    '6000',
    '2018—11—10',
    '2018—11—10',
    '2018—11—10',
    '修改'
  ],
  headData3: '添加出库信息',
  headList3: [
    '物品名称:',
    '出库责任人:',
    '出库数量:',
    '出库时间:'
  ],
  headData4: '添加入库信息',
  headList4: [
    '物品名称:',
    '出库责任人:',
    '出库数量:',
    '出库时间:'
  ]
}

export default {
  businessStaffTable,
  financeSalesTable,
  financeRefundTable,
  financeWithdrawTable,
  maintainerOnlineTable,
  maintainerUseRateTable,
  storeClerkStatusTable,
  storeClerkStatisticsTable
}
